.tsung/jing_new_tags_20221118-0223/newTags.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="18000"/>
    </clients>

    <servers>
        <server host="panda.eba-gaci4fx8.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
    </servers>

    <load>
    <arrivalphase phase="1" duration="30" unit="second"><users arrivalrate="1" unit="second"/></arrivalphase>
        <arrivalphase phase="2" duration="30" unit="second"><users arrivalrate="2" unit="second"/></arrivalphase>
        <arrivalphase phase="3" duration="30" unit="second"><users arrivalrate="4" unit="second"/></arrivalphase>
   </load>

    <options>
        <option name="file_server" id="userlist" value="user.csv"/>
    </options>

    <sessions>
        <session name="http-example" probability="100" type="ts_http">
            <transaction name="LOG_IN">
                <setdynvars sourcetype="file" fileid="userlist" delimiter="," order="iter">
                <var name="name"/>
                <var name="password"/>
                <var name="email"/>
                <var name="points"/>
                </setdynvars>
                <request>
                <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"/>
                <http url="/" method="GET" version="1.1"/>
                </request>
                <request> <http url="/login" method="GET" version="1.1"/> </request>
                <thinktime value="3" random="true"/>
                <request subst="true">
                <dyn_variable name="loginstatus" re="(.*)"/>
                <dyn_variable name="userid" re="Location: http://.*/users/(.*)\r"/>
                <http url="/login" contents="authenticity_token=%%_authenticity_token%%&amp;session[email]=%%_email%%&amp;session[password]=test" method="POST" version="1.1">
                </http>
                </request>
            </transaction>

            <transaction name="CREATE_TAG">
                <request>
                    <http url="/tags/new" method="GET" version="1.1"/>
                </request>

                <setdynvars sourcetype="random_string" length="50">
                    <var name="tagname"/>
                </setdynvars>
                <setdynvars sourcetype="random_string" length="20">
                    <var name="tagdescription"/>
                </setdynvars>

                <request subst="true">
                    <dyn_variable name="postquest" re="(.*)"/>
                    <http url="/tags" contents="authenticity_token=%%_authenticity_token%%&amp;tag[name]=%%tagname%%&amp;tag[description]=%%tagdescription%%" method="POST" version="1.1">
                    </http>
                </request>
            </transaction>

            <transaction name="VIEW_TAG">
                <request subst="true">
                    <http url="/tags" method="GET" version="1.1"/>
                </request>
            </transaction>

            <transaction name="VIEW_Profile">
                <request subst="true">
                    <http url="/users/%%_userid%%" method="GET" version="1.1"/>
                </request>
            </transaction>



            </session>
    </sessions>
</tsung>